
    [
    {
      "id": 27205,
      "title": "Inception",
      "overview": "Cobb, a skilled thief who commits corporate espionage by infiltrating the subconscious of his targets is offered a chance to regain his old life as payment for a task considered to be impossible: 'inception', the implantation of another person's idea into a target's subconscious.",
      "rating": 8.4,
      "imageUrl": "https://image.tmdb.org/t/p/w185/s3TBrRGB1iav7gFOCNx3H31MoES.jpg"
    },
    {
      "id": 157336,
      "title": "Interstellar",
      "overview": "The adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.",
      "rating": 8.4,
      "imageUrl": "https://image.tmdb.org/t/p/w185/vgnoBSVzWAV9sNQUORaDGvDp7wx.jpg"
    },
    {
      "id": 155,
      "title": "The Dark Knight",
      "overview": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.",
      "rating": 8.5,
      "imageUrl": "https://image.tmdb.org/t/p/w185/nMKdUUepR0i5zn0y1T4CsSB5chy.jpg"
    },
    {
      "id": 24428,
      "title": "The Avengers",
      "overview": "When an unexpected enemy emerges and threatens global safety and security, Nick Fury, director of the international peacekeeping agency known as S.H.I.E.L.D., finds himself in need of a team to pull the world back from the brink of disaster. Spanning the globe, a daring recruitment effort begins!",
      "rating": 7.7,
      "imageUrl": "https://image.tmdb.org/t/p/w185/9BBTo63ANSmhC4e6r62OJFuK2GL.jpg"
    },
    {
      "id": 293660,
      "title": "Deadpool",
      "overview": "The origin story of former Special Forces operative turned mercenary Wade Wilson, who, after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life.",
      "rating": 7.6,
      "imageUrl": "https://image.tmdb.org/t/p/w185/n28I7FNYIT934OoHhKZn4IIDsrQ.jpg"
    },
    {
      "id": 19995,
      "title": "Avatar",
      "overview": "In the 22nd century, a paraplegic Marine is dispatched to the moon Pandora on a unique mission, but becomes torn between following orders and protecting an alien civilization.",
      "rating": 7.5,
      "imageUrl": "https://image.tmdb.org/t/p/w185/7ABsaBkO1jA2psC8Hy4IDhkID4h.jpg"
    },
    {
      "id": 299536,
      "title": "Avengers: Infinity War",
      "overview": "As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment - the fate of Earth and existence itself has never been more uncertain.",
      "rating": 8.3,
      "imageUrl": "https://image.tmdb.org/t/p/w185/mDfJG3LC3Dqb67AZ52x3Z0jU0uB.jpg"
    },
    {
      "id": 550,
      "title": "Fight Club",
      "overview": "A ticking-time-bomb insomniac and a slippery soap salesman channel primal male aggression into a shocking new form of therapy. Their concept catches on, with underground 'fight clubs' forming in every town, until an eccentric gets in the way and ignites an out-of-control spiral toward oblivion.",
      "rating": 8.4,
      "imageUrl": "https://image.tmdb.org/t/p/w185/c6OLXfKAk5BKeR6broC8pYiCquX.jpg"
    },
    {
      "id": 118340,
      "title": "Guardians of the Galaxy",
      "overview": "Light years from Earth, 26 years after being abducted, Peter Quill finds himself the prime target of a manhunt after discovering an orb wanted by Ronan the Accuser.",
      "rating": 7.9,
      "imageUrl": "https://image.tmdb.org/t/p/w185/2UFxrUHVuSK3Tth7DvQQlF4mGTd.jpg"
    },
    {
      "id": 680,
      "title": "Pulp Fiction",
      "overview": "A burger-loving hit man, his philosophical partner, a drug-addled gangster's moll and a washed-up boxer converge in this sprawling, comedic crime caper. Their adventures unfurl in three stories that ingeniously trip back and forth in time.",
      "rating": 8.5,
      "imageUrl": "https://image.tmdb.org/t/p/w185/suaEOtk1N1sgg2MTM7oZd2cfVp3.jpg"
    },
    {
      "id": 13,
      "title": "Forrest Gump",
      "overview": "A man with a low IQ has accomplished great things in his life and been present during significant historic events—in each case, far exceeding what anyone imagined he could do. But despite all he has achieved, his one true love eludes him.",
      "rating": 8.5,
      "imageUrl": "https://image.tmdb.org/t/p/w185/67HggiWaP9ZLv5sPYmyRV37yAJM.jpg"
    },
    {
      "id": 671,
      "title": "Harry Potter and the Philosopher's Stone",
      "overview": "Harry Potter has lived under the stairs at his aunt and uncle's house his whole life. But on his 11th birthday, he learns he's a powerful wizard—with a place waiting for him at the Hogwarts School of Witchcraft and Wizardry. As he learns to harness his newfound powers with the help of the school's kindly headmaster, Harry uncovers the truth about his parents' deaths—and about the villain who's to blame.",
      "rating": 7.9,
      "imageUrl": "https://image.tmdb.org/t/p/w185/t3LicFpYHeYpwqm7L5wDpd22hL5.jpg"
    },
    {
      "id": 1726,
      "title": "Iron Man",
      "overview": "After being held captive in an Afghan cave, billionaire engineer Tony Stark creates a unique weaponized suit of armor to fight evil.",
      "rating": 7.6,
      "imageUrl": "https://image.tmdb.org/t/p/w185/s6cQgJSkviamXAXBggT2xmj7JiG.jpg"
    },
    {
      "id": 68718,
      "title": "Django Unchained",
      "overview": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.",
      "rating": 8.2,
      "imageUrl": "https://image.tmdb.org/t/p/w185/6MCVqErhPC0p6RkzZsLuIb6LZ1L.jpg"
    },
    {
      "id": 278,
      "title": "The Shawshank Redemption",
      "overview": "Framed in the 1940s for the double murder of his wife and her lover, upstanding banker Andy Dufresne begins a new life at the Shawshank prison, where he puts his accounting skills to work for an amoral warden. During his long stretch in prison, Dufresne comes to be admired by the other inmates -- including an older prisoner named Red -- for his integrity and unquenchable sense of hope.",
      "rating": 8.7,
      "imageUrl": "https://image.tmdb.org/t/p/w185/kXfqcdQKsToO0OUXHcrrNCHDBzO.jpg"
    },
    {
      "id": 603,
      "title": "The Matrix",
      "overview": "Set in the 22nd century, The Matrix tells the story of a computer hacker who joins a group of underground insurgents fighting the vast and powerful computers who now rule the earth.",
      "rating": 8.2,
      "imageUrl": "https://image.tmdb.org/t/p/w185/l4QHerTSbMI7qgvasqxP36pqjN6.jpg"
    },
    {
      "id": 299534,
      "title": "Avengers: Endgame",
      "overview": "After the devastating events of Avengers: Infinity War, the universe is in ruins due to the efforts of the Mad Titan, Thanos. With the help of remaining allies, the Avengers must assemble once more in order to undo Thanos' actions and restore order to the universe once and for all, no matter what consequences may be in store.",
      "rating": 8.3,
      "imageUrl": "https://image.tmdb.org/t/p/w185/7RyHsO4yDXtBv1zUU3mTpHeQ0d5.jpg"
    },
    {
      "id": 120,
      "title": "The Lord of the Rings: The Fellowship of the Ring",
      "overview": "Young hobbit Frodo Baggins, after inheriting a mysterious ring from his uncle Bilbo, must leave his home in order to keep it from falling into the hands of its evil creator. Along the way, a fellowship is formed to protect the ringbearer and make sure that the ring arrives at its final destination: Mt. Doom, the only place where it can be destroyed.",
      "rating": 8.4,
      "imageUrl": "https://image.tmdb.org/t/p/w185/gU84vBGG2x8K3x1zrz4SggiN5hr.jpg"
    },
    {
      "id": 597,
      "title": "Titanic",
      "overview": "101-year-old Rose DeWitt Bukater tells the story of her life aboard the Titanic, 84 years later. A young Rose boards the ship with her mother and fiancé. Meanwhile, Jack Dawson and Fabrizio De Rossi win third-class tickets aboard the ship. Rose tells the whole story from Titanic's departure through to its death—on its first and last voyage—on April 15, 1912.",
      "rating": 7.9,
      "imageUrl": "https://image.tmdb.org/t/p/w185/3WjbxaqYB4vAbdUfdr5vbglD2JZ.jpg"
    },
    {
      "id": 475557,
      "title": "Joker",
      "overview": "During the 1980s, a failed stand-up comedian is driven insane and turns to a life of crime and chaos in Gotham City while becoming an infamous psychopathic crime figure.",
      "rating": 8.2,
      "imageUrl": "https://image.tmdb.org/t/p/w185/hO7KbdvGOtDdeg0W4Y5nKEHeDDh.jpg"
    }
]
